/*Άσκηση 1
Έχουμε μηχανικά αντικείμενα (Machinery) που χαρακτηρίζονται από ένα όνομα και ένα βάρος.
Επίσης έχουμε οχήματα (Vehicle) και υπολογιστές (Computer) που είναι και μηχανικά αντικείμενα.
1. Ορίστε τις κατάλληλες κλάσεις που μοντελοποιούν την παραπάνω ιεραρχία. Η Machinery θα
έχει και συναρτήσεις getter για το όνομα και το βάρος. H Machinery έχει και μία συνάρτηση
operate που δέχεται έναν ακέραιο (ο οποίος θα έχει και κάποια default τιμή) και θα εκτυπώνει
ότι το αντικείμενο δούλεψε για τόσες ώρες. Δοκιμάστε τα παραπάνω στη main.
2. Επαναορίστε την operate (override) σε κάθε υποκλάση της Machinery. Για την Computer, ας
γίνεται χρήση και της αρχικής operate (αυτή της Machinery).
3. Ορίστε την operate της Machinery σαν pure virtual. Επίσης ορίστε τον destructor της
Machinery σαν virtual. Δοκιμάστε τις αλλαγές που προκαλούνται στη main (με και χωρίς το
virtual).*/

#include <iostream>
#include <string>
using namespace std;